rails/app/controllers/dialog_turns_controller.rb

SELECT * FROM "dialog_turns"
---
  def index
    @dialog_turns = DialogTurn.all

SELECT * FROM "dialog_turns" WHERE ("dialog_turns"."id" = 1)
---
  def show
    @dialog_turn = DialogTurn.find(params[:id])

SELECT * FROM "dialog_turns" WHERE ("dialog_turns"."id" = 1)
---
  def edit
    @dialog_turn = DialogTurn.find(params[:id])