rails/app/controllers/guide_pages_controller.rb

SELECT * FROM "guide_pages"
---
  def index
    @guide_pages = GuidePage.all

SELECT * FROM "guide_pages" WHERE ("guide_pages"."id" = 1)
---
  def show
    @guide_page = GuidePage.find(params[:id])

SELECT * FROM "guide_pages" WHERE ("guide_pages"."id" = 1)
---
  def edit
    @guide_page = GuidePage.find(params[:id])

INSERT INTO "guide_pages" ("guide_page_sequence_id", "introText", "axes_id", "created_at", "title", "sensorAppletShouldBeEnabled", "updated_at", "dataSeries_id", "shoulDdShowImage", "index", "firstDialogTurn_id") VALUES('equence-1', '<p>You are going to try moving in different ways on a straight path while collecting data with a motion sensor.</p><p>When you are ready, click Start to record the position and time data for your movements. Walk on the path for 30 seconds. Experiment with different kinds of motions (walking fast, slow, forward, backward…). Click Stop after 30 seconds are up.</p>', 'axes-sensor', '2010-07-06 08:42:21', '2', 't', '2010-07-06 08:42:21', 'series-sensor', 'f', 1, 'turn-2-start')
---
  def create
    @guide_page = GuidePage.new(params[:guide_page])

    respond_to do |format|
      if @guide_page.save

SELECT * FROM "guide_pages" WHERE ("guide_pages"."id" = 2)
UPDATE "guide_pages" SET "updated_at" = '2010-07-06 14:50:27', "title" = 'new', "introText" = '<b>Hello</b><p>Have you ever tried to tell someone a story about a trip you took? Most likely, your story included words and pictures. In this activity, you will tell stories that convey information about motion during a specific type of journey.</p><p>You will learn that the motion of an object can be described by its position, direction of motion, and speed. Motion can be measured and represented on a graph.</p>' WHERE "id" = 1
---
  def update
    @guide_page = GuidePage.find(params[:id])

    respond_to do |format|
      if @guide_page.update_attributes(params[:guide_page])