rails/app/controllers/guide_page_sequences_controller.rb

  def index
    @guide_page_sequences = GuidePageSequence.all
---
SELECT * FROM "guide_page_sequences"

  def show
    @guide_page_sequence = GuidePageSequence.find(params[:id])
---
SELECT * FROM "guide_page_sequences" WHERE ("guide_page_sequences"."id" = 1)

  def edit
    @guide_page_sequence = GuidePageSequence.find(params[:id])
---
SELECT * FROM "guide_page_sequences" WHERE ("guide_page_sequences"."id" = 1)