rails/app/controllers/static_annotations_controller.rb

SELECT * FROM "static_annotations"
---
  def index
    @static_annotations = StaticAnnotation.all